Autodesk.Revit.DB.IFCExportOptions.AddOption(System.String,System.String)
Adds a new named option to the options structure.
Remarks:
Named options can be used to set options not accessible through the standard IFC export user interface.
It is up to the implementation of the IExporterIFC interface to customize export behavior based on these options.
name:
The option name.
value:
The option value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFCExportOptions.Assign(Autodesk.Revit.DB.IFCExportOptions)
Assigns the values of the IFCExportOptions to this options object.
sourceOptions:
The source IFCExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.FilterViewId
Id of the view whose visibility settings will govern the contents in the exported IFC file.
This should be set to the id of the view, or InvalidElementId if there is to be no special filtering applied (all model elements
will be exported).  Default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.FamilyMappingFile
Path to a file containing family mapping.
Remarks:
The file, if specified, contains data describing how to map
generic family instances to IFC containers (element types). This property
may be empty, in which case the current mapping will be used.
The default is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.IFCExportOptions.#ctor(Autodesk.Revit.DB.IFCExportOptions)
Creates a copy of an IFCExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011